Revit 2024 API
ImporterIFC.Document Property
 Gets the document associated with the import.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public Document Document { get; }
Visual Basic
Public ReadOnly Property Document As Document
	Get
Visual C++
public:
property Document^ Document {
	Document^ get ();
}
See Also
ImporterIFC Class
Autodesk.Revit.DB.IFC Namespace